Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/80?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/80?closed=1>`__.

source: Fixed missing sanitizing of arguments to Git and Mercurial - :cve:`2022-23915`, see :ghsa:`3872-f48p-pxqj` for more details.
sv: Fixat saknad sanering av argument till Git och Mercurial - :cve:`2022-23915`, se :ghsa:`3872-f48p-pxqj` fÃ¶r mer information.

source: Fixed loading fuzzy strings from CSV files.
sv: Fixade laddning av fuzzy-strÃ¤ngar frÃ¥n CSV-filer.

source: Added support for creating teams using the API.
sv: Lagt till stÃ¶d fÃ¶r att skapa team med hjÃ¤lp av API.

source: Fixed user mention suggestions display.
sv: Fast visning av fÃ¶rslag pÃ¥ anvÃ¤ndaromnÃ¤mnanden.

source: The project tokens access can now be customized.
sv: Ã tkomsten till projektets tokens kan nu anpassas.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/78?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/78?closed=1>`__.

source: *Released on February 25th 2022.*
sv: *SlÃ¤pptes den 25 februari 2022.*

source: Fixes stored XSS - :cve:`2022-24710`, see :ghsa:`6jp6-9rf9-gc66` for more details.
sv: Fixar lagrad XSS - :cve:`2022-24710`, se :ghsa:`6jp6-9rf9-gc66` fÃ¶r mer information.

source: Fixed add-on installation using the API.
sv: Fast tillÃ¤ggsinstallation med hjÃ¤lp av API.

source: Renamed :guilabel:`Strings needing action` to :guilabel:`Unfinished strings`.
sv: OmdÃ¶pt :guilabel:`StrÃ¤ngar som behÃ¶ver Ã¥tgÃ¤rdas` till :guilabel:`Oavslutade strÃ¤ngar`.

source: Fixed false positives from :ref:`check-icu-message-format-syntax`.
sv: Fixade falska positiva resultat frÃ¥n :ref:`check-icu-message-format-syntax`.

source: Indicate lock and contributor agreement on other occurrences listing.
sv: Ange lÃ¥s och bidragsgivaravtal pÃ¥ andra hÃ¤ndelser i listan.

source: Fixed updating PO files with obsolete strings or missing plurals.
sv: Fixade uppdatering av PO-filer med fÃ¶rÃ¥ldrade strÃ¤ngar eller saknade pluralformer.

source: Improved squash add-on compatibility with Gerrit.
sv: FÃ¶rbÃ¤ttrad kompatibilitet mellan squash-tillÃ¤gget och Gerrit.

source: Automatically initialize user languages based on the :http:header:`Accept-Language` header.
sv: Initialisera automatiskt anvÃ¤ndarsprÃ¥k baserat pÃ¥ :http:header:`Accept-Language`-rubriken.

source: Improved error handling on string removal.
sv: FÃ¶rbÃ¤ttrad felhantering vid borttagning av strÃ¤ngar.

source: Weblate now requires Python 3.7 or newer.
sv: Weblate krÃ¤ver nu Python 3.7 eller nyare.

source: Fixed some write operations with project token authentication.
sv: Fixade nÃ¥gra skrivoperationer med projekt-token-autentisering.

source: Fixed string state tracking when the strings changes in the repository.
sv: Fast strÃ¤ngstatus spÃ¥ras nÃ¤r strÃ¤ngarna Ã¤ndras i arkivet.

source: Track string changes from the repository.
sv: SpÃ¥ra strÃ¤ngÃ¤ndringar frÃ¥n arkivet.

source: Sticky header on translations listing to improve navigation.
sv: Fast rubrik pÃ¥ Ã¶versÃ¤ttningslistan fÃ¶r att fÃ¶rbÃ¤ttra navigeringen.

source: Fixed untranslating strings in :ref:`javaprop`.
sv: Fixade strÃ¤ngar som inte kunde Ã¶versÃ¤ttas i :ref:`javaprop`.

source: Fixed Git operation with non-ASCII branch names.
sv: Fixat Git-fel med icke-ASCII-grennamn.

source: New add-on :ref:`addon-weblate.generate.prefill`.
sv: Nytt tillÃ¤gg :ref:`addon-weblate.generate.prefill`.

source: Added :guilabel:`Merge without fast-forward` :ref:`component-merge_style`.
sv: Lagt till :guilabel:`Sammanfoga utan snabbspolning` :ref:`component-merge_style`.

source: Fixed :ref:`addon-weblate.autotranslate.autotranslate` add-on triggering for newly added strings.
sv: Fixat :ref:`addon-weblate.autotranslate.autotranslate`-tillÃ¤gget som utlÃ¶ses fÃ¶r nyligen tillagda strÃ¤ngar.

source: Added support for defining custom teams at project level to grant users access, see :ref:`manage-acl`.
sv: Lagt till stÃ¶d fÃ¶r att definiera anpassade team pÃ¥ projektnivÃ¥ fÃ¶r att ge anvÃ¤ndare Ã¥tkomst, se :ref:`manage-acl`.

source: Added documentation links to alerts.
sv: LÃ¤nkar till dokumentation har lagts till i varningarna.

source: Docker container automatically enables TLS/SSL for outgoing e-mail when needed.
sv: Docker-containern aktiverar automatiskt TLS/SSL fÃ¶r utgÃ¥ende e-post nÃ¤r det behÃ¶vs.

source: Added support for searching for resolved comments.
sv: Lagt till stÃ¶d fÃ¶r sÃ¶kning efter lÃ¶sta kommentarer.

source: Added support for borgbackup 1.2.
sv: StÃ¶d fÃ¶r borgbackup 1.2 har lagts till.

source: Fixed applying of :guilabel:`Automatically translated` label.
sv: Fast tillÃ¤mpning av :guilabel:`Automatiskt Ã¶versatt`-etikett.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/75?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/75?closed=1>`__.

source: The implementation of :ref:`manage-acl` has changed, removing the project prefix from the group names. This affects API users.
sv: Implementeringen av :ref:`manage-acl` har Ã¤ndrats, vilket innebÃ¤r att projektprefixet har tagits bort frÃ¥n gruppnamnen. Detta pÃ¥verkar API-anvÃ¤ndare.

source: Weblate now uses ``charset-normalizer`` instead of ``chardet`` module for character set detection.
sv: Weblate anvÃ¤nder nu ``charset-normalizer`` istÃ¤llet fÃ¶r ``chardet``-modulen fÃ¶r teckenuppsÃ¤ttningsdetektering.

source: **Changed in 4.11.1:** There is a change in ``REST_FRAMEWORK`` setting (removal of one of the backends in ``DEFAULT_AUTHENTICATION_CLASSES``).
sv: **Ãndrat i 4.11.1:** Det finns en Ã¤ndring i instÃ¤llningen ``REST_FRAMEWORK`` (borttagning av en av backendarna i ``DEFAULT_AUTHENTICATION_CLASSES``).

source: *Released on December 22nd 2021.*
sv: *SlÃ¤pptes den 22 december 2021.*

source: Documented changes introduced by upgrading to Django 4.0.
sv: Dokumenterade Ã¤ndringar som infÃ¶rts genom uppgradering till Django 4.0.

source: Fixed displaying of :guilabel:`Automatically translated` label.
sv: Fast visning av etiketten :guilabel:`Automatiskt Ã¶versatt`.

source: Fixed API display of branch in components with a shared repository.
sv: Fast API-visning av gren i komponenter med ett delat arkiv.

source: Improved analysis on the failed push alert.
sv: FÃ¶rbÃ¤ttrad analys av misslyckade push-aviseringar.

source: Fixed manually editing page when browsing changes.
sv: Fixat manuell redigering av sidan vid blÃ¤ddring av Ã¤ndringar.

source: Improved accuracy of :ref:`check-kashida`.
sv: FÃ¶rbÃ¤ttrad noggrannhet fÃ¶r :ref:`check-kashida`.

source: The Weblate Docker container now uses Python 3.10.
sv: Weblate Docker-containern anvÃ¤nder nu Python 3.10.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/76?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/76?closed=1>`__.

source: *Released on December 16th 2021.*
sv: *SlÃ¤pptes den 16 december 2021.*

source: Added support for formality and placeholders with DeepL.
sv: Lagt till stÃ¶d fÃ¶r formaliteter och platshÃ¥llare med DeepL.

source: Bulk edit and search-and-replace are now available on project and language level.
sv: Massredigering och sÃ¶k-och-ersÃ¤tt-funktioner Ã¤r nu tillgÃ¤ngliga pÃ¥ projekt- och sprÃ¥knivÃ¥.

source: Added filtering to search and replace.
sv: Lagt till filtrering fÃ¶r sÃ¶kning och ersÃ¤ttning.

source: Fixed: "Perform automatic translation" privilege is no longer part of the *Languages* group.
sv: Fixat: BehÃ¶righeten "UtfÃ¶r automatisk Ã¶versÃ¤ttning" ingÃ¥r inte lÃ¤ngre i gruppen *SprÃ¥k*.

source: "Perform automatic translation" is in the *Administration* and the new *Automatic translation* group.
sv: "UtfÃ¶r automatisk Ã¶versÃ¤ttning" finns i *Administration* och den nya gruppen *Automatisk Ã¶versÃ¤ttning*.

source: Fixed generating XLSX files with special chars.
sv: Fixat generering av XLSX-filer med specialtecken.

source: Added ability to the GitHub authentication backend to check if the user belongs to a specific GitHub organization or team.
sv: Lagt till funktion i GitHub-autentiseringsbackend fÃ¶r att kontrollera om anvÃ¤ndaren tillhÃ¶r en specifik GitHub-organisation eller ett specifikt GitHub-team.

source: Improved feedback on invalid parameters passed to API.
sv: FÃ¶rbÃ¤ttrad feedback om ogiltiga parametrar som skickas till API.

source: Added support for project scoped access tokens for API.
sv: Lagt till stÃ¶d fÃ¶r Ã¥tkomsttoken med projektomfattning fÃ¶r API.

source: Fixed string removal in some cases.
sv: Fast strÃ¤ngborttagning i vissa fall.

source: Fixed translating newly added strings.
sv: Fixade Ã¶versÃ¤ttning av nyligen tillagda strÃ¤ngar.

source: Label automatically translated strings to ease their filtering.
sv: MÃ¤rk automatiskt Ã¶versatta strÃ¤ngar fÃ¶r att underlÃ¤tta filtreringen.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/74?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/74?closed=1>`__.

source: There is a change in per-project groups, the upgrade can take long time on sites with thousands of projects.
sv: Det har skett en fÃ¶rÃ¤ndring i grupperna per projekt, uppgraderingen kan ta lÃ¥ng tid pÃ¥ webbplatser med tusentals projekt.

source: Django 4.0 has made some incompatible changes, see :ref:`django:backwards-incompatible-4.0`. Weblate still supports Django 3.2 for now, in case any of these are problematic. Most notable changes which might affect Weblate:
sv: Django 4.0 har gjort nÃ¥gra inkompatibla Ã¤ndringar, se :ref:`django:backwards-incompatible-4.0`. Weblate stÃ¶der fortfarande Django 3.2 fÃ¶r tillfÃ¤llet, ifall nÃ¥got av dessa skulle vara problematiskt. De mest anmÃ¤rkningsvÃ¤rda Ã¤ndringarna som kan pÃ¥verka Weblate:

source: Dropped support for PostgreSQL 9.6, Django 4.0 supports PostgreSQL 10 and higher.
sv: StÃ¶det fÃ¶r PostgreSQL 9.6 har upphÃ¶rt, Django 4.0 stÃ¶der PostgreSQL 10 och hÃ¶gre.

source: Format of :setting:`django:CSRF_TRUSTED_ORIGINS` was changed.
sv: Formatet fÃ¶r :setting:`django:CSRF_TRUSTED_ORIGINS` har Ã¤ndrats.

source: The Docker container now uses Django 4.0, see above for changes.
sv: Docker-containern anvÃ¤nder nu Django 4.0, se ovan fÃ¶r Ã¤ndringar.

source: *Released on November 19th 2021.*
sv: *SlÃ¤pptes den 19 november 2021.*

source: Fixed upload of monolingual files after changing template.
sv: Fast uppladdning av ensprÃ¥kiga filer efter Ã¤ndring av mall.

source: Improved handling of whitespace in flags.
sv: FÃ¶rbÃ¤ttrad hantering av blanksteg i flaggor.

source: Add support for filtering in download API.
sv: LÃ¤gg till stÃ¶d fÃ¶r filtrering i nedladdnings-API.

source: Fixed statistics display when adding new translations.
sv: Fast statistikvisning vid tillÃ¤gg av nya Ã¶versÃ¤ttningar.

source: Mitigate issues with GitHub SSH key change.
sv: Minska problem med GitHub SSH-nyckelÃ¤ndring.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/73?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/73?closed=1>`__.

source: *Released on November 10th 2021.*
sv: *SlÃ¤pptes den 10 november 2021.*

source: Provide more details for events in history.
sv: Ge mer detaljer om historiska hÃ¤ndelser.

source: Improved rendering of history.
sv: FÃ¶rbÃ¤ttrad Ã¥tergivning av historik.

source: Improved performance of the translation pages.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r Ã¶versÃ¤ttningssidorna.

source: Added support for restricting translation file downloads.
sv: Lagt till stÃ¶d fÃ¶r att begrÃ¤nsa nedladdningar av Ã¶versÃ¤ttningsfiler.

source: The ``safe-html`` can now understand Markdown when used with ``md-text``.
sv: ``safe-html`` kan nu fÃ¶rstÃ¥ Markdown nÃ¤r det anvÃ¤nds med ``md-text``.

source: The ``max-length`` tag now ignores XML markup when used with ``xml-text``.
sv: Taggen ``max-length`` ignorerar nu XML-markeringar nÃ¤r den anvÃ¤nds med ``xml-text``.

source: Fixed dimensions of rendered texts in :ref:`check-max-size`.
sv: Fasta dimensioner fÃ¶r renderade texter i :ref:`check-max-size`.

source: Lowered app store title length to 30 to assist with upcoming Google policy changes.
sv: Minskade appbutikens titellÃ¤ngd till 30 fÃ¶r att underlÃ¤tta kommande policyÃ¤ndringar frÃ¥n Google.

source: Added support for customizing SSH invocation via :setting:`SSH_EXTRA_ARGS`.
sv: Lagt till stÃ¶d fÃ¶r anpassning av SSH-anrop via :setting:`SSH_EXTRA_ARGS`.

source: Added checks for ICU MessageFormat.
sv: Lagt till kontroller fÃ¶r ICU MessageFormat.

source: Improved error condition handling in machine translation backends.
sv: FÃ¶rbÃ¤ttrad hantering av fel i bakgrundsprogram fÃ¶r maskinÃ¶versÃ¤ttning.

source: Highlight unusual whitespace characters in the strings.
sv: Markera ovanliga blanktecken i strÃ¤ngarna.

source: Added option to stay on translated string while editing.
sv: Lagt till alternativ fÃ¶r att stanna kvar pÃ¥ Ã¶versatt strÃ¤ng under redigering.

source: Added support for customizing Borg invocation via :setting:`BORG_EXTRA_ARGS`.
sv: Lagt till stÃ¶d fÃ¶r anpassning av Borg-anrop via :setting:`BORG_EXTRA_ARGS`.

source: Fixed generating of MO files for monolingual translations.
sv: Fast generering av MO-filer fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: Added API endpoint to download all component translations as a ZIP file.
sv: Lagt till API-slutpunkt fÃ¶r att ladda ner alla komponentÃ¶versÃ¤ttningar som en ZIP-fil.

source: Added support for Python 3.10.
sv: StÃ¶d fÃ¶r Python 3.10 har lagts till.

source: Added support for resending e-mail invitation from the management interface.
sv: Lagt till stÃ¶d fÃ¶r att skicka om e-postinbjudningar frÃ¥n administrationsgrÃ¤nssnittet.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/71?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/71?closed=1>`__.

source: There is a change in storing metrics, the upgrade can take long time on larger sites.
sv: Det har skett en fÃ¶rÃ¤ndring i lagringen av mÃ¤tvÃ¤rden, uppgraderingen kan ta lÃ¥ng tid pÃ¥ stÃ¶rre webbplatser.

source: *Released on September 10th 2021.*
sv: *SlÃ¤pptes den 10 september 2021.*

source: Fixed user removal in Django admin interface.
sv: Fast anvÃ¤ndarborttagning i Djangos administratÃ¶rsgrÃ¤nssnitt.

source: Document add-on parameters in greater detail.
sv: Dokumentera tillÃ¤ggsparametrar mer detaljerat.

source: Fixed JavaScript error in glossary.
sv: RÃ¤ttat JavaScript-fel i ordlistan.

source: Add limit to number of matches in consistency check.
sv: LÃ¤gg till begrÃ¤nsning fÃ¶r antalet matchningar i konsistenskontrollen.

source: Improve handling of placeholders in machine translations.
sv: FÃ¶rbÃ¤ttra hanteringen av platshÃ¥llare i maskinÃ¶versÃ¤ttningar.

source: Fixed creating add-ons using the API.
sv: Fixat skapande av tillÃ¤gg med hjÃ¤lp av API.

source: Added :setting:`PRIVACY_URL` setting to add privacy policy link to the footer.
sv: Lagt till instÃ¤llningen :setting:`PRIVACY_URL` fÃ¶r att lÃ¤gga till en lÃ¤nk till sekretesspolicyn i sidfoten.

source: Hide member e-mail addresses from project admins.
sv: DÃ¶lj medlemmarnas e-postadresser frÃ¥n projektadministratÃ¶rer.

source: Improved gettext PO merging in case of conflicts.
sv: FÃ¶rbÃ¤ttrad gettext PO-sammanslagning vid konflikter.

source: Improved glossary highlighting.
sv: FÃ¶rbÃ¤ttrad markering av ordlista.

source: Improved ``safe-html`` flag behavior with XML checks.
sv: FÃ¶rbÃ¤ttrad funktion fÃ¶r flaggan ``safe-html`` med XML-kontroller.

source: Fixed commit messages for linked components.
sv: Fixade commit-meddelanden fÃ¶r lÃ¤nkade komponenter.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/70?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/70?closed=1>`__.

source: *Released on August 21th 2021.*
sv: *SlÃ¤ppt den 21 augusti 2021.*

source: Added support for Apple stringsdict format.
sv: StÃ¶d fÃ¶r Apple stringsdict-format har lagts till.

source: The exact search operator is now case-sensitive with PostgreSQL.
sv: Den exakta sÃ¶koperatorn Ã¤r nu skiftlÃ¤geskÃ¤nslig med PostgreSQL.

source: Fixed saving glossary explanations in some cases.
sv: RÃ¤ttade fÃ¶rklaringar i ordlistan i vissa fall.

source: Fixed adding strings to monolingual glossary components.
sv: Fixat tillÃ¤gg av strÃ¤ngar till ensprÃ¥kiga ordlistekomponenter.

source: Improved performance in handling variants.
sv: FÃ¶rbÃ¤ttrad prestanda vid hantering av varianter.

source: Fixed squash add-on sometimes skipping parsing upstream changes.
sv: Fast squash-tillÃ¤gg som ibland hoppar Ã¶ver analys av uppstrÃ¶msÃ¤ndringar.

source: Preserve file extension for downloads.
sv: Bevara filÃ¤ndelsen fÃ¶r nedladdningar.

source: Added support for the Fluent format.
sv: StÃ¶d fÃ¶r Fluent-formatet har lagts till.

source: Added support for using tabs to indent JSON formats.
sv: Lagt till stÃ¶d fÃ¶r att anvÃ¤nda tabbar fÃ¶r att indra JSON-format.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/67?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/67?closed=1>`__.

source: There are no additional upgrade steps needed in this release.
sv: Det krÃ¤vs inga ytterligare uppgraderingssteg i den hÃ¤r versionen.

source: *Released on July 15th 2021.*
sv: *SlÃ¤pptes den 15 juli 2021.*

source: Support more language aliases to be configured on a project.
sv: StÃ¶d fÃ¶r fler sprÃ¥kaliaser som kan konfigureras i ett projekt.

source: Fixed search string validation in API.
sv: Fixad validering av sÃ¶kstrÃ¤ng i API.

source: Fixed Git exporter URLs after a domain change.
sv: Fixade Git-exportÃ¶rens URL:er efter en domÃ¤nÃ¤ndring.

source: Fixed cleanup add-on for Windows RC files.
sv: Fast tillÃ¤gg fÃ¶r rensning av Windows RC-filer.

source: Fixed possible crash in XLIFF updating.
sv: Fixat mÃ¶jligt krasch vid uppdatering av XLIFF.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/69?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/69?closed=1>`__.

source: *Released on June 30th 2021.*
sv: *SlÃ¤pptes den 30 juni 2021.*

source: Improved popup for adding terms to glossary.
sv: FÃ¶rbÃ¤ttrad popup-ruta fÃ¶r att lÃ¤gga till termer i ordlistan.

source: Added support for LibreTranslate machine translation service.
sv: StÃ¶d fÃ¶r maskinÃ¶versÃ¤ttningstjÃ¤nsten LibreTranslate har lagts till.

source: Added rate limiting on creating new projects.
sv: Tillagd hastighetsbegrÃ¤nsning vid skapande av nya projekt.

source: Improved performance of file updates.
sv: FÃ¶rbÃ¤ttrad prestanda vid filuppdateringar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/68?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/68?closed=1>`__.

source: *Released on June 17th 2021.*
sv: *SlÃ¤pptes den 17 juni 2021.*

source: Improved configuration health check.
sv: FÃ¶rbÃ¤ttrad hÃ¤lsokontroll av konfigurationen.

source: Added support for ``object-pascal-format`` used in gettext PO, see :ref:`check-object-pascal-format`.
sv: Lagt till stÃ¶d fÃ¶r ``object-pascal-format`` som anvÃ¤nds i gettext PO, se :ref:`check-object-pascal-format`.

source: Renamed :guilabel:`Nearby keys` to :guilabel:`Similar keys` to better describe the purpose.
sv: OmdÃ¶pt :guilabel:`NÃ¤rliggande nycklar` till :guilabel:`Liknande nycklar` fÃ¶r att bÃ¤ttre beskriva syftet.

source: Added support for :ref:`mi18n-lang`.
sv: Lagt till stÃ¶d fÃ¶r :ref:`mi18n-lang`.

source: Improved SAML authentication integration.
sv: FÃ¶rbÃ¤ttrad SAML-autentiseringsintegration.

source: Fixed :ref:`vcs-gerrit` integration to better handle corner cases.
sv: Fixat :ref:`vcs-gerrit`-integration fÃ¶r att bÃ¤ttre hantera specialfall.

source: Weblate now requires Django 3.2.
sv: Weblate krÃ¤ver nu Django 3.2.

source: Fixed inviting users when e-mail authentication is disabled.
sv: Fixat att bjuda in anvÃ¤ndare nÃ¤r e-postautentisering Ã¤r inaktiverad.

source: Improved language definitions.
sv: FÃ¶rbÃ¤ttrade sprÃ¥kdefinitioner.

source: Added support for blocking users from contributing to a project.
sv: Lagt till stÃ¶d fÃ¶r att blockera anvÃ¤ndare frÃ¥n att bidra till ett projekt.

source: Fixed automatic creation of glossary languages.
sv: Fast automatisk skapande av ordlistorsprÃ¥k.

source: Extended documentation about add-ons.
sv: UtÃ¶kad dokumentation om tillÃ¤gg.

source: Performance improvements for components with linked repositories.
sv: PrestandafÃ¶rbÃ¤ttringar fÃ¶r komponenter med lÃ¤nkade arkiv.

source: Added support for free DeepL API.
sv: Lagt till stÃ¶d fÃ¶r gratis DeepL API.

source: The user management no longer needs Django admin interface.
sv: AnvÃ¤ndarhanteringen behÃ¶ver inte lÃ¤ngre Djangos administratÃ¶rsgrÃ¤nssnitt.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/64?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/64?closed=1>`__.

source: Notable configuration or dependencies changes:
sv: Viktiga Ã¤ndringar i konfiguration eller beroenden:

source: There are several changes in :file:`settings_example.py`, most notable middleware changes (:setting:`django:MIDDLEWARE`), please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, framfÃ¶r allt Ã¤ndringar i mellanprogramvaran (:setting:`django:MIDDLEWARE`). Justera dina instÃ¤llningar dÃ¤refter.

source: The :ref:`mt-deepl` machine translation now has a generic ``MT_DEEPL_API_URL`` setting to adapt to different subscription models more flexibly. The ``MT_DEEPL_API_VERSION`` setting is no longer used.
sv: MaskinÃ¶versÃ¤ttningen :ref:`mt-deepl` har nu en generisk instÃ¤llning ``MT_DEEPL_API_URL`` fÃ¶r att anpassa sig till olika abonnemangsmodeller pÃ¥ ett mer flexibelt sÃ¤tt. InstÃ¤llningen ``MT_DEEPL_API_VERSION`` anvÃ¤nds inte lÃ¤ngre.

source: Django 3.2 is now required.
sv: Django 3.2 krÃ¤vs nu.

source: *Released on May 8th 2021.*
sv: *SlÃ¤pptes den 8 maj 2021.*

source: Fixed crash after moving shared component between projects.
sv: Krasch efter flytt av delad komponent mellan projekt har Ã¥tgÃ¤rdats.

source: Fixed adding new strings to empty properties files.
sv: Fixat tillÃ¤gg av nya strÃ¤ngar till tomma egenskapsfiler.

source: Fixed copy icon alignment in RTL languages.
sv: Fixat ikonernas placering i RTL-sprÃ¥k.

source: Extended string statistics on the Info tab.
sv: UtÃ¶kad strÃ¤ngstatistik pÃ¥ fliken Info.

source: Fixed handling of translation files ignored in Git.
sv: Fast hantering av Ã¶versÃ¤ttningsfiler som ignoreras i Git.

source: Improved metrics performance.
sv: FÃ¶rbÃ¤ttrad mÃ¤tprestanda.

source: Fixed possible bug in saving glossaries.
sv: Fixat mÃ¶jligt fel vid sparande av ordlistor.

source: Fixed consistency check behavior on languages with different plural rules.
sv: Fixat beteendet fÃ¶r konsistenskontroll pÃ¥ sprÃ¥k med olika pluralregler.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/66?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/66?closed=1>`__.

source: *Released on May 2nd 2021.*
sv: *SlÃ¤pptes den 2 maj 2021.*

source: Remove obsolete spam protection code.
sv: Ta bort fÃ¶rÃ¥ldrad kod fÃ¶r skrÃ¤ppostskydd.

source: Improve source plural check accuracy.
sv: FÃ¶rbÃ¤ttra noggrannheten vid kontroll av pluralformer.

source: Update list of user interface languages in Docker.
sv: Uppdatera listan Ã¶ver sprÃ¥k fÃ¶r anvÃ¤ndargrÃ¤nssnittet i Docker.
